# read design
read_verilog Phy.v
hierarchy -check -top Phy

# the high level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping flip-flops to cmos_cells.lib
dfflibmap -liberty cmos_cells.lib

# mapping logic to cmos_cells.lib
abc -liberty cmos_cells.lib

# cleanup
clean

# write synthesized design
write_verilog Phy_synth.v