read_verilog DeMuxL1.v 
hierarchy -check -top DeMuxL1
proc; opt; fsm; opt; memory; opt;
techmap; opt
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib
clean
write_verilog demux_L1_synth.v
